ConfigFiles/InformationRegisters/ИзмененияВВетках.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ИзмененияВВетках</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ОписаниеИзменений</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПодробноеОписаниеИзменений</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Согласующий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусСогласования</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыСогласованияИзмененийВВетках</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УстановилСтатус</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаИзмененияСтатусаСогласования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КомментарийСогласования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПредыдущееПодробноеОписаниеИзменений</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПредыдущийСтатусСогласования</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыСогласованияИзмененийВВетках</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоммитСогласования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПредыдущаяДатаИзмененияСтатусаСогласования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПредыдущийУстановилСтатус</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипИзменения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыИзмененийОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Ветка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Ветки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектМетаданных</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подсистемы</v8:Type>
						<v8:Type>cfg:CatalogRef.ОбъектыМетаданных</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПодчиненныйОбъект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РеквизитыОбъектовМетаданных</v8:Type>
						<v8:Type>cfg:CatalogRef.МакетыОбъектовМетаданных</v8:Type>
						<v8:Type>cfg:CatalogRef.ФормыОбъектовМетаданных</v8:Type>
						<v8:Type>cfg:EnumRef.ТипыМодулейОбъектовМетаданных</v8:Type>
						<v8:Type>cfg:CatalogRef.КомандыОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ConfigFiles/InformationRegisters/СостояниеЗагрузкиМетаданныхВВетках.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СостояниеЗагрузкиМетаданныхВВетках</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДанныеКоммита</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаЗагрузки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Ветка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Ветки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ConfigFiles/Enums/СтатусыСогласованияИзмененийВВетках.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтатусыСогласованияИзмененийВВетках</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Согласовано</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеСогласовано</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТребуетСогласования</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеТребуетСогласования</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ConfigFiles/Enums/ТипыИзмененийОбъектовМетаданных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыИзмененийОбъектовМетаданных</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Добавлен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Удален</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Изменен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ConfigFiles/Enums/РежимРазработки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>РежимРазработки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>БезИзменений</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВGitРепозитории</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВХранилище</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ConfigFiles/Catalogs/Пользователи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Пользователи</Name>
			<Comment>АПК:413 - №744.2.1.1 Допустимо не отключать историю выбора, так как она используется, а переопределение отбора фиксированное, то есть служебные и недействительные пользователи в нее не попадут, но если как-то попали, то это не является проблемой</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Недействителен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Подразделение</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ФизическоеЛицо</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Служебный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подготовлен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПользователяИБ</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПользователяСервиса</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьСвойстваПользователяИБ</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Фотография</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДляСписка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

ConfigFiles/InformationRegisters/ИзмененияВВетках/Forms/ИзмененияВВетке/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТекущийПользователь = Пользователи.ТекущийПользователь();
	
	СтруктураБыстрогоОтбора = Неопределено;
	Параметры.Свойство("СтруктураБыстрогоОтбора", СтруктураБыстрогоОтбора);
	
	Если Параметры.Свойство("ОтборНеУказанСогласующий") Тогда
		ОтборНеУказанСогласующий = Параметры.ОтборНеУказанСогласующий;
	КонецЕсли;
	
	Если Параметры.Свойство("ОтборНеУказанОтветственный") Тогда
		ОтборНеУказанОтветственный = Параметры.ОтборНеУказанОтветственный;
	КонецЕсли;
	
	Если ОбщегоНазначенияСППРКлиентСервер.НеобходимОтборПоКолонкеПриСозданииНаСервере("Согласующий", Согласующий, СтруктураБыстрогоОтбора) Тогда
		УстановитьОтборПоСогласующему();
	КонецЕсли;
	
	Если ОбщегоНазначенияСППРКлиентСервер.НеобходимОтборПоКолонкеПриСозданииНаСервере("Ответственный", Справочники.Пользователи.ПустаяСсылка(), СтруктураБыстрогоОтбора) Тогда
		УстановитьОтборПоОтветственному();
	КонецЕсли;
	
	Если ОбщегоНазначенияСППРКлиентСервер.НеобходимОтборПоКолонкеПриСозданииНаСервере("СтатусСогласования", СписокСтатусовСогласования, СтруктураБыстрогоОтбора) Тогда
		УстановитьОтборПоСтатусуСогласования();
	КонецЕсли;
	
	Если ОбщегоНазначенияСППРКлиентСервер.НеобходимОтборПоКолонкеПриСозданииНаСервере("ОбъектДобавлен", ОтборНовыеОбъекты, СтруктураБыстрогоОтбора) Тогда
		УстановитьОтборПоНовымОбъектам();
	КонецЕсли;
	
	УстановитьОтборПоПроекту();
	
	ДоступноИзменениеХронометража = УправлениеДоступом.ЕстьРоль("ИзменениеДанныхХронометража");
	
	ВидДеятельностиДляСогласованияИзменений = Константы.ВидДеятельностиДляСогласованияИзмененийМетаданныхВВетках.Получить();
	
	НастроитьКомандуХронометража();
	
	УстановитьДоступностьЭлементов();

	УстановитьРеквизитыФормы();
	СсылкаВРепозитории = СсылкаВРепозитории();
	
КонецПроцедуры

&НаСервере
Процедура ПередЗагрузкойДанныхИзНастроекНаСервере(Настройки)
	
	Если ОбщегоНазначенияСППРКлиентСервер.НеобходимОтборПоКолонкеПередЗагрузкойИзНастроек("Согласующий",
			"Согласующий",
			Согласующий,
			СтруктураБыстрогоОтбора,
			Настройки) Тогда
			
		УстановитьОтборПоСогласующему();
	КонецЕсли;
	
	Если ОбщегоНазначенияСППРКлиентСервер.НеобходимОтборПоКолонкеПередЗагрузкойИзНастроек("СтатусСогласования",
			"СписокСтатусовСогласования",
			СписокСтатусовСогласования,
			СтруктураБыстрогоОтбора,
			Настройки) Тогда
			
		УстановитьОтборПоСтатусуСогласования();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ПереключенХронометраж"
		И ЗначениеЗаполнено(ВидДеятельностиДляСогласованияИзменений) Тогда
		УчетВремениКлиентСервер.ОбработатьПереключениеХронометража(Параметр, ЭтаФорма, ВидДеятельностиДляСогласованияИзменений);
	КонецЕсли;

	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОтборСогласующийПриИзменении(Элемент)
	
	УстановитьОтборПоСогласующему();
	
КонецПроцедуры

&НаКлиенте
Процедура СписокСтатусовСогласованияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	СтруктураПараметров = Новый Структура("СписокВыбора", СписокСтатусовСогласования);
	
	ОткрытьФорму("Перечисление.СтатусыСогласованияИзмененийВВетках.Форма.ВыборСпискаСтатусов", СтруктураПараметров, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокСтатусовСогласованияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СписокСтатусовСогласования = ВыбранноеЗначение;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокСтатусовСогласованияПриИзменении(Элемент)
	
	УстановитьОтборПоСтатусуСогласования();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборНовыеОбъектыПриИзменении(Элемент)
	
	УстановитьОтборПоНовымОбъектам();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура УстановитьСтатусТребуетСогласования(Команда)
	
	КлючиЗаписей = Новый Массив;
	   
	Для Каждого ВыделеннаяСтрока из Элементы.Список.ВыделенныеСтроки Цикл
		КлючиЗаписей.Добавить(ВыделеннаяСтрока);
	КонецЦикла;
	
	Если КлючиЗаписей.Количество()>0 Тогда
		ОбработатьЗаписи(КлючиЗаписей, ПредопределенноеЗначение("Перечисление.СтатусыСогласованияИзмененийВВетках.ТребуетСогласования"), Неопределено);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСтатусНеТребуетСогласования(Команда)
	
	КлючиЗаписей = Новый Массив;
	   
	Для Каждого ВыделеннаяСтрока из Элементы.Список.ВыделенныеСтроки Цикл
		КлючиЗаписей.Добавить(ВыделеннаяСтрока);
	КонецЦикла;
	
	Если КлючиЗаписей.Количество()>0 Тогда
		ОбработатьЗаписи(КлючиЗаписей, ПредопределенноеЗначение("Перечисление.СтатусыСогласованияИзмененийВВетках.НеТребуетСогласования"), Неопределено);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСтатусСогласовано(Команда)
	
	КлючиЗаписей = Новый Массив;
	   
	Для Каждого ВыделеннаяСтрока из Элементы.Список.ВыделенныеСтроки Цикл
		КлючиЗаписей.Добавить(ВыделеннаяСтрока);
	КонецЦикла;
	
	Если КлючиЗаписей.Количество()>0 Тогда
		
		ПараметрыФормы = Новый Структура;
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("КлючиЗаписей", КлючиЗаписей);
	    ДополнительныеПараметры.Вставить("Статус", ПредопределенноеЗначение("Перечисление.СтатусыСогласованияИзмененийВВетках.Согласовано"));
		
		ОписаниеОповещения = Новый ОписаниеОповещения("УстановитьСтатусСогласованияЗавершение", ЭтотОбъект, ДополнительныеПараметры);
		ОткрытьФорму("РегистрСведений.ИзмененияВВетках.Форма.КомментарийСогласования",
				 ПараметрыФормы,
				 ЭтаФорма,
				 ,
				 ,
				 ,
				 ОписаниеОповещения,
				 РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСтатусСогласованоБезКомментария(Команда)
	
	КлючиЗаписей = Новый Массив;
	   
	Для Каждого ВыделеннаяСтрока из Элементы.Список.ВыделенныеСтроки Цикл
		КлючиЗаписей.Добавить(ВыделеннаяСтрока);
	КонецЦикла;
	
	УстанавливаемыйСтатус = ПредопределенноеЗначение("Перечисление.СтатусыСогласованияИзмененийВВетках.Согласовано");
	
	Если КлючиЗаписей.Количество()>0 Тогда
		ОбработатьЗаписи(КлючиЗаписей, УстанавливаемыйСтатус, Неопределено);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСтатусНеСогласовано(Команда)

	КлючиЗаписей = Новый Массив;
	   
	Для Каждого ВыделеннаяСтрока из Элементы.Список.ВыделенныеСтроки Цикл
		КлючиЗаписей.Добавить(ВыделеннаяСтрока);
	КонецЦикла;
	
	Если КлючиЗаписей.Количество()>0 Тогда
		
		ПараметрыФормы = Новый Структура;
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("КлючиЗаписей", КлючиЗаписей);
	    ДополнительныеПараметры.Вставить("Статус", ПредопределенноеЗначение("Перечисление.СтатусыСогласованияИзмененийВВетках.НеСогласовано"));
		
		ОписаниеОповещения = Новый ОписаниеОповещения("УстановитьСтатусСогласованияЗавершение", ЭтотОбъект, ДополнительныеПараметры);
		ОткрытьФорму("РегистрСведений.ИзмененияВВетках.Форма.КомментарийСогласования",
				 ПараметрыФормы,
				 ЭтаФорма,
				 ,
				 ,
				 ,
				 ОписаниеОповещения,
				 РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиККоммитамВетки(Команда)
	
	Если НЕ ЗначениеЗаполнено(ВеткаОтбор) Тогда
		Возврат;
	КонецЕсли;  

	ТекстКоманды = ПерейтиККоммитамВеткиСервер(ВеткаОтбор);
	Если НЕ ЗначениеЗаполнено(ТекстКоманды) Тогда
		Возврат;
	КонецЕсли;	
	
	НачатьЗапускПриложения(Новый ОписаниеОповещения, ТекстКоманды);
	
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиККоммитамПоМетаданному(Команда)
	Если НЕ ЗначениеЗаполнено(ВеткаОтбор) Тогда
		Возврат;
	КонецЕсли;	                     
	
	Если Элементы.Список.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;	
	
	ДанныеИзЗаписиРС = ДанныеИзЗаписиРС(Элементы.Список.ТекущаяСтрока);
	
	ИзмененыеФайлы = ИзмененыеФайлыДляПереходаККоммитамПоМетаданному(
		ДанныеИзЗаписиРС.ПодробноеОписаниеИзменений, ВеткаОтбор, "commits");
		
	ОткрытьГиперссылкуПоИзмененнымФайлам(ИзмененыеФайлы);
		
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиКИзменениямВнутриФайла(Команда)
	Если НЕ ЗначениеЗаполнено(ВеткаОтбор) Тогда
		Возврат;
	КонецЕсли;	
	
	Если Элементы.Список.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;	
	
	ДанныеИзЗаписиРС = ДанныеИзЗаписиРС(Элементы.Список.ТекущаяСтрока);
	
	ИзмененыеФайлы = ИзмененыеФайлыДляПереходаККоммитамПоМетаданному(
		ДанныеИзЗаписиРС.ПодробноеОписаниеИзменений, ВеткаОтбор, "blame");
		
	ОткрытьГиперссылкуПоИзмененнымФайлам(ИзмененыеФайлы);
КонецПроцедуры
	
&НаКлиенте
Процедура ПерейтиКСравнениюСВеткойПриемником(Команда)
	Если НЕ ЗначениеЗаполнено(ВеткаОтбор) Тогда
		Возврат;
	КонецЕсли;	
	
	Если Элементы.Список.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;	
	
	ДанныеИзЗаписиРС = ДанныеИзЗаписиРС(Элементы.Список.ТекущаяСтрока);
	
	ПодробноеОписаниеИзменений = ДанныеИзЗаписиРС.ПодробноеОписаниеИзменений; 
	
	ИзмененыеФайлы = ПерейтиКСравнениюСВеткойПриемникомСервер(ВеткаОтбор, ПодробноеОписаниеИзменений);
	
	ОткрытьГиперссылкуПоИзмененнымФайлам(ИзмененыеФайлы);
КонецПроцедуры

&НаКлиенте
Процедура ИзмененияСПредыдущегоСогласованияПоВсемОбъектам(Команда)
	Если НЕ ЗначениеЗаполнено(ВеткаОтбор) Тогда
		Возврат;
	КонецЕсли;	
	
	Если Элементы.Список.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеИзЗаписиРС = ДанныеИзЗаписиРС(Элементы.Список.ТекущаяСтрока);
	
	ТекстКоманды = ГиперссылкаИзмененияСПредыдущегоСогласованияПоВсемОбъектам(ВеткаОтбор,
		ДанныеИзЗаписиРС.ОбъектМетаданных, ДанныеИзЗаписиРС.ПодчиненныйОбъект);
	Если НЕ ЗначениеЗаполнено(ТекстКоманды) Тогда
		Возврат;
	КонецЕсли;	
	
	НачатьЗапускПриложения(Новый ОписаниеОповещения, ТекстКоманды);
		
КонецПроцедуры

&НаКлиенте
Процедура ИзмененияСПредыдущегоСогласованияПоТекущемуОбъекту(Команда)
	Если НЕ ЗначениеЗаполнено(ВеткаОтбор) Тогда
		Возврат;
	КонецЕсли;	
	
	Если Элементы.Список.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;	   
	
	ДанныеИзЗаписиРС = ДанныеИзЗаписиРС(Элементы.Список.ТекущаяСтрока);
	
	ИзмененыеФайлы = ИзмененыеФайлыДляПереходаКИзменениямСПоследнегоСогласования(
		ДанныеИзЗаписиРС.ПодробноеОписаниеИзменений, ВеткаОтбор,
		ДанныеИзЗаписиРС.ОбъектМетаданных, ДанныеИзЗаписиРС.ПодчиненныйОбъект);
		
	Если ИзмененыеФайлы = Неопределено Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Не найдено предыдущее согласование.'"));
		Возврат;
	КонецЕсли;		
		
	ОткрытьГиперссылкуПоИзмененнымФайлам(ИзмененыеФайлы);
КонецПроцедуры

&НаКлиенте
Процедура СравнитьСВеткойПриемникомНаКоммитСогласования(Команда)
	Если НЕ ЗначениеЗаполнено(ВеткаОтбор) Тогда
		Возврат;
	КонецЕсли;	
	
	Если Элементы.Список.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;	 
	
	ДанныеИзЗаписиРС = ДанныеИзЗаписиРС(Элементы.Список.ТекущаяСтрока);
	
	ИзмененыеФайлы = ИзмененыеФайлыДляПереходаКСравнениюВеткиПриемникаСПредыдущимКоммитомСогласования(
		ДанныеИзЗаписиРС.ПодробноеОписаниеИзменений, ВеткаОтбор,
		ДанныеИзЗаписиРС.ОбъектМетаданных, ДанныеИзЗаписиРС.ПодчиненныйОбъект);
		
	ОткрытьГиперссылкуПоИзмененнымФайлам(ИзмененыеФайлы);
КонецПроцедуры

&НаКлиенте
Процедура ПереключитьХронометраж(Команда)
	
	Если НЕ ЗначениеЗаполнено(ВидДеятельностиДляСогласованияИзменений) Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеХронометража = ПереключитьХронометражНаСервере(ВидДеятельностиДляСогласованияИзменений);
	
	Элементы.ПереключитьХронометраж.Пометка = НЕ Элементы.ПереключитьХронометраж.Пометка;
	
	Оповестить("ПереключенХронометраж", ДанныеХронометража, ЭтотОбъект);
	
	Если ДанныеХронометража.ХронометражЗавершен Тогда
		ДанныеОповещения = Новый Структура;
		ДанныеОповещения.Вставить("Начало", ДанныеХронометража.НачалоЗавершеннойРаботы);
		ДанныеОповещения.Вставить("Окончание", ДанныеХронометража.ОкончаниеЗавершеннойРаботы);
		
		Оповестить("ЗаписаныДанныеКалендаря", ДанныеОповещения, ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СравнитьСВерсиейВеткиПриемника(Команда)
	Если НЕ ЗначениеЗаполнено(ВеткаОтбор) Тогда
		Возврат;
	КонецЕсли;	                     
	
	Если Элементы.Список.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;	
	
	ДанныеИзЗаписиРС = ДанныеИзЗаписиРС(Элементы.Список.ТекущаяСтрока);
	
	ИзмененыеФайлы = ИзмененыеФайлыДляПереходаККоммитамПоМетаданному(
		ДанныеИзЗаписиРС.ПодробноеОписаниеИзменений, ВеткаОтбор, "commits");

	Если ИзмененыеФайлы.Количество() = 1 Тогда
		ПоказатьСравнениеФайлаССостояниемВеткиПриемника(ИзмененыеФайлы[0].ИмяФайла);
	ИначеЕсли ИзмененыеФайлы.Количество() >= 1 Тогда
		Спс = ОбщегоНазначенияСППРКлиент.СписокИзмененныхФайловДляВыбора(ИзмененыеФайлы);
		
		ОбработкаОповещения = Новый ОписаниеОповещения("СравнитьСВерсиейВеткиПриемникаЗавершение", ЭтотОбъект);
		Спс.ПоказатьВыборЭлемента(ОбработкаОповещения, НСтр("ru = 'Выберите файл'"))	
	КонецЕсли;		
		
КонецПроцедуры

&НаКлиенте
Процедура СравнитьСВерсиейПоследнегоСогласования(Команда)
	Если НЕ ЗначениеЗаполнено(ВеткаОтбор) Тогда
		Возврат;
	КонецЕсли;	                     
	
	Если Элементы.Список.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеИзЗаписиРС = ДанныеИзЗаписиРС(Элементы.Список.ТекущаяСтрока);
	ИзмененыеФайлы = ИзмененыеФайлыДляПереходаКИзменениямСПоследнегоСогласования(
		ДанныеИзЗаписиРС.ПодробноеОписаниеИзменений, ВеткаОтбор,
		ДанныеИзЗаписиРС.ОбъектМетаданных, ДанныеИзЗаписиРС.ПодчиненныйОбъект);
		
	Если ИзмененыеФайлы = Неопределено Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Не найдено предыдущее согласование.'"));
		Возврат;
	КонецЕсли;		

	Если ИзмененыеФайлы.Количество() = 1 Тогда
		ПоказатьСравнениеФайлаССостояниемКоммитаСогласования(ИзмененыеФайлы[0]);
	ИначеЕсли ИзмененыеФайлы.Количество() >= 1 Тогда
		Спс = ОбщегоНазначенияСППРКлиент.СписокИзмененныхФайловДляВыбора(ИзмененыеФайлы);
		
		ОбработкаОповещения = Новый ОписаниеОповещения("СравнитьСВерсиейПоследнегоСогласованияЗавершение", ЭтотОбъект);
		Спс.ПоказатьВыборЭлемента(ОбработкаОповещения, НСтр("ru = 'Выберите файл'"))	
	КонецЕсли;		
		
КонецПроцедуры

&НаКлиенте
Процедура НазначитьСогласующегоОтветственного(Команда)
	
	КлючиЗаписей = Новый Массив;
	   
	Для Каждого ВыделеннаяСтрока из Элементы.Список.ВыделенныеСтроки Цикл
		КлючиЗаписей.Добавить(ВыделеннаяСтрока);
	КонецЦикла;
	
	Если КлючиЗаписей.Количество()>0 Тогда
		
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("КлючиЗаписей", КлючиЗаписей);
		
		ОписаниеОповещения = Новый ОписаниеОповещения("НазначитьСогласующегоОтветственногоЗавершение", ЭтотОбъект, ДополнительныеПараметры);
		ОткрытьФорму("РегистрСведений.ИзмененияВВетках.Форма.НазначениеСогласующегоОтветственного",
				 ,
				 ЭтаФорма,
				 ,
				 ,
				 ,
				 ОписаниеОповещения,
				 РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	КонецЕсли;
			 
КонецПроцедуры

&НаКлиенте
Процедура НазначитьСогласующего(Команда)
	
	КлючиЗаписей = Новый Массив;
	   
	Для Каждого ВыделеннаяСтрока из Элементы.Список.ВыделенныеСтроки Цикл
		КлючиЗаписей.Добавить(ВыделеннаяСтрока);
	КонецЦикла;
	
	Если КлючиЗаписей.Количество()>0 Тогда
		
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("КлючиЗаписей", КлючиЗаписей);
		
		ОписаниеОповещения = Новый ОписаниеОповещения("НазначитьСогласующегоЗавершение", ЭтотОбъект, ДополнительныеПараметры);
		ОткрытьФорму("РегистрСведений.ИзмененияВВетках.Форма.ВыборПользователя",
				 ,
				 ЭтаФорма,
				 ,
				 ,
				 ,
				 ОписаниеОповещения,
				 РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЯСогласующий(Команда)
	
	УстановитьОтборПоСогласующемуТекущемуПользователю();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УстановитьСтатусСогласованияЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(Результат) = Тип("Структура") Тогда
		ОбработатьЗаписи(ДополнительныеПараметры.КлючиЗаписей, ДополнительныеПараметры.Статус, Результат);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборПоСогласующему()
	
	ИспользоватьОтбор = ЗначениеЗаполнено(Согласующий) ИЛИ ОтборНеуказанСогласующий;
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список,
																			"Согласующий",
																			Согласующий,
																			ВидСравненияКомпоновкиДанных.Равно,
																			,
																			ИспользоватьОтбор);
																			
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборПоОтветственному()
	
	ИспользоватьОтбор = ОтборНеуказанОтветственный;
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список,
																			"Ответственный",
																			Справочники.Пользователи.ПустаяСсылка(),
																			ВидСравненияКомпоновкиДанных.Равно,
																			,
																			ИспользоватьОтбор);
																			
КонецПроцедуры
																		
&НаСервере
Процедура УстановитьОтборПоСтатусуСогласования()
	
	ИспользоватьОтбор = СписокСтатусовСогласования.Количество()>0;
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список,
																			"СтатусСогласования",
																			СписокСтатусовСогласования,
																			ВидСравненияКомпоновкиДанных.ВСписке,
																			,
																			ИспользоватьОтбор);
																			
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборПоНовымОбъектам()
	
	ИспользоватьОтбор = ОтборНовыеОбъекты;
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список,
																			"ТипИзменения",
																			Перечисления.ТипыИзмененийОбъектовМетаданных.Добавлен,
																			ВидСравненияКомпоновкиДанных.Равно,
																			,
																			ИспользоватьОтбор);
																			
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборПоПроекту()
	
	Если НЕ Параметры.Отбор.Свойство("Ветка") Тогда
		Проект = ПараметрыСеанса.ТекущийПроект;
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Проект", Проект, ВидСравненияКомпоновкиДанных.Равно,,ЗначениеЗаполнено(Проект));
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьЗаписи(КлючиЗаписей, Статус, ДанныеИзмененияКомментария)
	
	ДатаИзмененияСтатуса = ТекущаяДата();
	
	Если ТипЗнч(ДанныеИзмененияКомментария) = Тип("Структура") Тогда
		Комментарий = ДанныеИзмененияКомментария.Комментарий;
		ИзменятьКомментарий = ДанныеИзмененияКомментария.ИзменятьКомментарий;
	Иначе
		Комментарий = "";
		ИзменятьКомментарий = Истина
	КонецЕсли;
	
	Для Каждого КлючЗаписи из КлючиЗаписей Цикл
		
		Попытка
			МенеджерЗаписи = РегистрыСведений.ИзмененияВВетках.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(МенеджерЗаписи, КлючЗаписи);
			МенеджерЗаписи.Прочитать();
			МенеджерЗаписи.УстановилСтатус = ТекущийПользователь;
			МенеджерЗаписи.ДатаИзмененияСтатусаСогласования = ДатаИзмененияСтатуса;
			МенеджерЗаписи.СтатусСогласования = Статус;
			
			Если ИзменятьКомментарий Тогда
				МенеджерЗаписи.КомментарийСогласования = Комментарий;
			КонецЕсли;
			
			МенеджерЗаписи.Записать();
		Исключение
			ТекстСообщения = НСтр("ru='Изменения не записаны (Ветка %Ветка%', Объект метаданных %ОбъектМетаданных%, Подчиненный объект %ПодчиненныйОбъект%");
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Ветка%", КлючЗаписи.Ветка);
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ОбъектМетаданных%", КлючЗаписи.ОбъектМетаданных);
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ПодчиненныйОбъект%", КлючЗаписи.ПодчиненныйОбъект);
			ТекстСообщения = ТекстСообщения + ОписаниеОшибки();
			
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			Возврат;
		КонецПопытки;
		
	КонецЦикла;
	
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьДоступностьЭлементов()
	
	ДоступноИзменениеРегистра = УправлениеДоступом.ЕстьРоль("ИзменениеДанныхОбИзмененииВВетках");
	
	ДоступноИзменениеОбъектовМетаданных = УправлениеДоступом.ЕстьРоль("ДобавлениеИзменениеОбъектовМетаданных");
	
	Если Элементы.Найти("СписокКонтекстноеМенюУстановитьСтатусСогласовано") <> Неопределено Тогда
		Элементы.СписокКонтекстноеМенюУстановитьСтатусСогласовано.Доступность = ДоступноИзменениеРегистра;
	КонецЕсли;
	
	Если Элементы.Найти("СписокКонтекстноеМенюУстановитьСтатусНеСогласовано") <> Неопределено Тогда
		Элементы.СписокКонтекстноеМенюУстановитьСтатусНеСогласовано.Доступность = ДоступноИзменениеРегистра;
	КонецЕсли;
	
	Если Элементы.Найти("СписокУстановитьСтатусСогласованоБезКомментария") <> Неопределено Тогда
		Элементы.СписокУстановитьСтатусСогласованоБезКомментария.Доступность = ДоступноИзменениеРегистра;
	КонецЕсли;
	
	Если Элементы.Найти("СписокУстановитьСтатусНеСогласовано") <> Неопределено Тогда
		Элементы.СписокУстановитьСтатусНеСогласовано.Доступность = ДоступноИзменениеРегистра;
	КонецЕсли;
	
	Если Элементы.Найти("СписокКонтекстноеМенюУстановитьСтатусТребуетСогласования") <> Неопределено Тогда
		Элементы.СписокКонтекстноеМенюУстановитьСтатусТребуетСогласования.Доступность = ДоступноИзменениеРегистра;
	КонецЕсли;
	
	Если Элементы.Найти("СписокКонтекстноеМенюУстановитьСтатусНеТребуетСогласования") <> Неопределено Тогда
		Элементы.СписокКонтекстноеМенюУстановитьСтатусНеТребуетСогласования.Доступность = ДоступноИзменениеРегистра;
	КонецЕсли;
	
	Если Элементы.Найти("СписокКонтекстноеМенюНазначитьОтветственногоИСогласующего") <> Неопределено Тогда
		Элементы.СписокКонтекстноеМенюНазначитьОтветственногоИСогласующего.Доступность =
			ДоступноИзменениеРегистра И ДоступноИзменениеОбъектовМетаданных;
	КонецЕсли;
	
	Если Элементы.Найти("СписокКонтекстноеМенюНазначитьСогласующего") <> Неопределено Тогда
		Элементы.СписокКонтекстноеМенюНазначитьСогласующего.Доступность = ДоступноИзменениеРегистра;
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Функция ДанныеЗагрузкиМетаданных(Ветка)
	
	Результат = Новый Структура;
	Результат.Вставить("ДанныеКоммита", Неопределено);
	Результат.Вставить("ДатаЗагрузки", Неопределено);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СостояниеЗагрузкиМетаданныхВВетках.ДанныеКоммита КАК ДанныеКоммита,
		|	СостояниеЗагрузкиМетаданныхВВетках.ДатаЗагрузки КАК ДатаЗагрузки
		|ИЗ
		|	РегистрСведений.СостояниеЗагрузкиМетаданныхВВетках КАК СостояниеЗагрузкиМетаданныхВВетках
		|ГДЕ
		|	СостояниеЗагрузкиМетаданныхВВетках.Ветка = &Ветка";
	
	Запрос.УстановитьПараметр("Ветка", Ветка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Результат, ВыборкаДетальныеЗаписи);
	КонецЦикла;
	
	Возврат Результат;

КонецФункции	

&НаСервере
Процедура УстановитьРеквизитыФормы()
	
	Если НЕ Параметры.Отбор.Свойство("Ветка") Тогда
		Возврат;
	КонецЕсли;
	
	ВеткаОтбор = Параметры.Отбор.Ветка;
КонецПроцедуры

&НаСервере
Функция СсылкаВРепозитории()
	
	Если НЕ ЗначениеЗаполнено(ВеткаОтбор) Тогда
		Возврат Неопределено;
	КонецЕсли;	
	
	Ветка = ВеткаОтбор;
	РежимРазработки = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ветка ,"РежимРазработки");
	
	Если РежимРазработки = Перечисления.РежимРазработки.ВХранилище Тогда
		Возврат Неопределено;
	КонецЕсли;	
	
	Проект = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ветка, "Владелец");
	ДанныеЗагрузкиМетаданных = ДанныеЗагрузкиМетаданных(Ветка);
	Если НЕ ЗначениеЗаполнено(ДанныеЗагрузкиМетаданных.ДанныеКоммита) Тогда
		Возврат НСтр("ru = 'Загрузка не выполнялась.'");
	КонецЕсли;	
	
	ДанныеПодключенияПроектаКGitСерверу = Тестирование.ДанныеПодключенияПроектаКGitСерверу(Проект);
	Стр = "https://" + ДанныеПодключенияПроектаКGitСерверу.РедактированиеСценариевВGitАдресСервера + "/"
		+ ДанныеПодключенияПроектаКGitСерверу.РедактированиеСценариевВGitИмяПроекта + "/-/commit/" + ДанныеЗагрузкиМетаданных.ДанныеКоммита;
		
	Стр = Тестирование.ЭкранироватьСпецсимволыWeb(Стр);	
	МассивСтрок = Новый Массив;
	МассивСтрок.Добавить(Новый ФорматированнаяСтрока(СтрШаблон(НСтр("ru = 'Последняя загрузка от %1 на коммит %2'"),
		ДанныеЗагрузкиМетаданных.ДатаЗагрузки, ДанныеЗагрузкиМетаданных.ДанныеКоммита)
		,,,,Стр));
	Возврат Новый ФорматированнаяСтрока(МассивСтрок);
КонецФункции

&НаСервере
Функция ПерейтиККоммитамВеткиСервер(Ветка)
	
	Возврат РаботаCGit.ПерейтиККоммитамВетки(Ветка);
	
КонецФункции

&НаСервереБезКонтекста
Функция ИзмененыеФайлыДляПереходаККоммитамПоМетаданному(Исходник, Ветка, Тип)
	
	Возврат РаботаCGit.ИзмененыеФайлыДляПереходаККоммитамПоМетаданному(Исходник, Ветка, Тип);
	
КонецФункции

&НаСервере
Функция ИзмененыеФайлыДляПереходаКСравнениюВеткиПриемникаСПредыдущимКоммитомСогласования(Исходник, Ветка, ОбъектМетаданных, ПодчиненныйОбъект)
	
	Возврат РаботаCGit.ИзмененыеФайлыДляПереходаКСравнениюВеткиПриемникаСПредыдущимКоммитомСогласования(Исходник, Ветка, ОбъектМетаданных, ПодчиненныйОбъект);
	
КонецФункции

&НаКлиенте
Процедура ВыборФайлаДляПереходаНаГитСерверЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	НачатьЗапускПриложения(Новый ОписаниеОповещения, Результат.Значение.Гиперссылка);
	
КонецПроцедуры	

&НаКлиенте
Процедура СравнитьСВерсиейВеткиПриемникаЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПоказатьСравнениеФайлаССостояниемВеткиПриемника(Результат.Значение.ИмяФайла)
	
КонецПроцедуры	

&НаКлиенте
Процедура СравнитьСВерсиейПоследнегоСогласованияЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПоказатьСравнениеФайлаССостояниемКоммитаСогласования(Результат.Значение)
	
КонецПроцедуры	

&НаКлиенте
Процедура ОткрытьГиперссылкуПоИзмененнымФайлам(ИзмененыеФайлы)
	
	Если ИзмененыеФайлы = Неопределено Тогда
		Возврат;
	КонецЕсли;	
	
	Если ИзмененыеФайлы.Количество() = 1 Тогда
		НачатьЗапускПриложения(Новый ОписаниеОповещения, ИзмененыеФайлы[0].Гиперссылка);
	ИначеЕсли ИзмененыеФайлы.Количество() >= 1 Тогда
		Спс = ОбщегоНазначенияСППРКлиент.СписокИзмененныхФайловДляВыбора(ИзмененыеФайлы);
		
		ОбработкаОповещения = Новый ОписаниеОповещения("ВыборФайлаДляПереходаНаГитСерверЗавершение", ЭтотОбъект);
		Спс.ПоказатьВыборЭлемента(ОбработкаОповещения, НСтр("ru = 'Выберите файл'"))	
	КонецЕсли;		
	
КонецПроцедуры

&НаСервере
Функция ГиперссылкаИзмененияСПредыдущегоСогласованияПоВсемОбъектам(Ветка, ОбъектМетаданных, ПодчиненныйОбъект)
	
	Возврат РаботаCGit.ГиперссылкаИзмененияСПредыдущегоСогласованияПоВсемОбъектам(Ветка, ОбъектМетаданных, ПодчиненныйОбъект);
	
КонецФункции   

&НаСервере
Функция ИзмененыеФайлыДляПереходаКИзменениямСПоследнегоСогласования(Исходник, Ветка, ОбъектМетаданных, ПодчиненныйОбъект)
	
	Возврат РаботаCGit.ИзмененыеФайлыДляПереходаКИзменениямСПоследнегоСогласования(Исходник, Ветка, ОбъектМетаданных, ПодчиненныйОбъект);
	
КонецФункции

&НаСервереБезКонтекста
Функция ПерейтиКСравнениюСВеткойПриемникомСервер(ВеткаОтбор, Исходник)
	
	Возврат РаботаCGit.ПерейтиКСравнениюСВеткойПриемникомСервер(ВеткаОтбор, Исходник);
	
КонецФункции	

&НаСервере
Функция ПереключитьХронометражНаСервере(Ссылка)
	
	Возврат УчетВремени.ПереключитьХронометраж(Ссылка);
	
КонецФункции

&НаСервере
Процедура НастроитьКомандуХронометража()
	
	КнопкаХронометража = Элементы.Найти("ПереключитьХронометраж");
	
	Если КнопкаХронометража <> Неопределено Тогда
		
		Если ЗначениеЗаполнено(ВидДеятельностиДляСогласованияИзменений) И ДоступноИзменениеХронометража Тогда
			
			КнопкаХронометража.Доступность = Истина;
			Если УчетВремени.ХронометражВключен(ТекущийПользователь, ВидДеятельностиДляСогласованияИзменений, "") Тогда
				КнопкаХронометража.Пометка = Истина;
			Иначе
				КнопкаХронометража.Пометка = Ложь;
			КонецЕсли;
		Иначе
			КнопкаХронометража.Доступность = Ложь;
		КонецЕсли;
		
	КонецЕсли;
		
КонецПроцедуры

&НаСервереБезКонтекста
Функция ТекущийТекстФайлаСервер(ВеткаОтбор, ИмяФайла)
	
	Ветка = ВеткаОтбор;
	ДанныеВетки = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ветка, "Владелец,Имя");
	Возврат ТестированиеЗапускТестирования.ТекстФайлаИзРепозитория(ДанныеВетки.Владелец, ИмяФайла, ДанныеВетки.Имя);
	
КонецФункции

&НаСервереБезКонтекста
Функция ТекстФайлаВВеткеПриемнике(ВеткаОтбор, ИмяФайла)
	
	Ветка = ВеткаОтбор;
	ДанныеВетки = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ветка, "Владелец,Приемник.Имя");
	Возврат ТестированиеЗапускТестирования.ТекстФайлаИзРепозитория(ДанныеВетки.Владелец, ИмяФайла, ДанныеВетки.ПриемникИмя);
	
КонецФункции

&НаСервереБезКонтекста
Функция ТекстФайлаНаКоммит(ВеткаОтбор, Коммит, ИмяФайла)
	
	Ветка = ВеткаОтбор;
	ДанныеВетки = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ветка, "Владелец");
	Возврат ТестированиеЗапускТестирования.ТекстФайлаИзРепозитория(ДанныеВетки.Владелец, ИмяФайла, Коммит);
	
КонецФункции

&НаКлиенте
Процедура ПоказатьСравнениеФайлаССостояниемВеткиПриемника(ИмяФайла)
	ТекущийТекстФайла = ТекущийТекстФайлаСервер(ВеткаОтбор, ИмяФайла);
	ТекстФайлаВВеткеПриемнике = ТекстФайлаВВеткеПриемнике(ВеткаОтбор, ИмяФайла);
	
	ПараметрыСравнения = Новый Структура;
	ПараметрыСравнения.Вставить("ТекстДляСравнения2", ТекущийТекстФайла);
	ПараметрыСравнения.Вставить("ОписаниеТекста2", НСтр("ru = 'Текущее значение в ветке'"));
	ПараметрыСравнения.Вставить("ТекстДляСравнения1", ТекстФайлаВВеткеПриемнике);
	ПараметрыСравнения.Вставить("ОписаниеТекста1", НСтр("ru = 'Значение в ветке приемнике'"));
	ПараметрыСравнения.Вставить("ИмяФайлаРепозитория", ИмяФайла);
	ТестированиеКлиент.ПоказатьОкноСравнениеТекста(ПараметрыСравнения);
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьСравнениеФайлаССостояниемКоммитаСогласования(ДанныеФайла)
	ИмяФайла = ДанныеФайла.ИмяФайла;
	ТекущийТекстФайла = ТекущийТекстФайлаСервер(ВеткаОтбор, ИмяФайла);
	ТекстФайлаНаКоммит = ТекстФайлаНаКоммит(ВеткаОтбор, ДанныеФайла.КоммитСогласования, ИмяФайла);
	
	ПараметрыСравнения = Новый Структура;
	ПараметрыСравнения.Вставить("ТекстДляСравнения2", ТекущийТекстФайла);
	ПараметрыСравнения.Вставить("ОписаниеТекста2", НСтр("ru = 'Текущее значение в ветке'"));
	ПараметрыСравнения.Вставить("ТекстДляСравнения1", ТекстФайлаНаКоммит);
	ПараметрыСравнения.Вставить("ОписаниеТекста1", НСтр("ru = 'Значение на момент согласования'"));
	ПараметрыСравнения.Вставить("ИмяФайлаРепозитория", ИмяФайла);
	ТестированиеКлиент.ПоказатьОкноСравнениеТекста(ПараметрыСравнения);
КонецПроцедуры

&НаКлиенте
Процедура НазначитьСогласующегоЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(Результат) = Тип("СправочникСсылка.Пользователи") Тогда
		НазначитьСогласующегоСервер(ДополнительныеПараметры.КлючиЗаписей, Результат);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НазначитьСогласующегоОтветственногоЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(Результат) = Тип("Структура") Тогда
		НазначитьСогласующегоОтветственногоСервер(ДополнительныеПараметры.КлючиЗаписей, Результат);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура НазначитьСогласующегоОтветственногоСервер(КлючиЗаписей, НазначаемыеПОльзователи)
	
	Для Каждого КлючЗаписи из КлючиЗаписей Цикл
		
		Попытка
			
			Если ЗначениеЗаполнено(КлючЗаписи.ОбъектМетаданных) Тогда
				
				Если ЗначениеЗаполнено(НазначаемыеПОльзователи.СогласующийПоУмолчанию)
					ИЛИ ЗначениеЗаполнено(НазначаемыеПОльзователи.Ответственный) Тогда
					
					ОбъектМетаданныхДляИзменения = КлючЗаписи.ОбъектМетаданных.ПолучитьОбъект();
					ОбъектМетаданныхДляИзменения.Заблокировать();
					
					Если ЗначениеЗаполнено(НазначаемыеПОльзователи.СогласующийПоУмолчанию) Тогда
						ОбъектМетаданныхДляИзменения.СогласующийИзменения = НазначаемыеПОльзователи.СогласующийПоУмолчанию;
					КонецЕсли;
					
					Если ЗначениеЗаполнено(НазначаемыеПОльзователи.Ответственный) Тогда
						ОбъектМетаданныхДляИзменения.Ответственный = НазначаемыеПОльзователи.Ответственный;
					КонецЕсли;
					
					ОбъектМетаданныхДляИзменения.Записать();
					ОбъектМетаданныхДляИзменения.Разблокировать();
				
				КонецЕсли;
				
			КонецЕсли;
			
		Исключение
			ТекстСообщения = НСтр("ru='Назначение для объекта метаданных %ОбъектМетаданных% не выполнено");
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ОбъектМетаданных%", КлючЗаписи.ОбъектМетаданных);
			ТекстСообщения = ТекстСообщения + ОписаниеОшибки();
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Продолжить;
		КонецПопытки;
		
	КонецЦикла;
	
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаСервере
Процедура НазначитьСогласующегоСервер(КлючиЗаписей, Пользователь)
	
	Для Каждого КлючЗаписи из КлючиЗаписей Цикл
		
		Попытка
			МенеджерЗаписи = РегистрыСведений.ИзмененияВВетках.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(МенеджерЗаписи, КлючЗаписи);
			МенеджерЗаписи.Прочитать();
			МенеджерЗаписи.Согласующий = Пользователь;
			МенеджерЗаписи.Записать();
		Исключение
			ТекстСообщения = НСтр("ru='Изменения не записаны (Ветка %Ветка%', Объект метаданных %ОбъектМетаданных%, Подчиненный объект %ПодчиненныйОбъект%");
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Ветка%", КлючЗаписи.Ветка);
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ОбъектМетаданных%", КлючЗаписи.ОбъектМетаданных);
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ПодчиненныйОбъект%", КлючЗаписи.ПодчиненныйОбъект);
			ТекстСообщения = ТекстСообщения + ОписаниеОшибки();
			
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			Возврат;
		КонецПопытки;
		
	КонецЦикла;
	
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ДанныеИзЗаписиРС(Знач КлючЗаписи)
	
	Запись = РегистрыСведений.ИзмененияВВетках.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(Запись, КлючЗаписи);
	Запись.Прочитать();
	
	Результат = Новый Структура;
	Результат.Вставить("ОбъектМетаданных", КлючЗаписи.ОбъектМетаданных);
	Результат.Вставить("ПодчиненныйОбъект", КлючЗаписи.ПодчиненныйОбъект);
	Результат.Вставить("ПодробноеОписаниеИзменений", Запись.ПодробноеОписаниеИзменений);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура УстановитьОтборПоСогласующемуТекущемуПользователю()

	Согласующий = Пользователи.ТекущийПользователь();
	УстановитьОтборПоСогласующему();
	
КонецПроцедуры

#КонецОбласти
